app/controllers/sync_controller.rb

  def put
    raise RequestError.new(:bad_param, "Parameter 'filename' is not valid") if params[:filename].nil? || params[:filename].empty?
    raise RequestError.new(:bad_param, "Parameter 'content_hash' is not valid") if params[:content_hash].nil? || params[:content_hash].empty?
    raise RequestError.new(:bad_param, "Parameter 'size' is not valid") if params[:size].nil? || params[:size].empty?

    current_content = Content.first content_hash: params[:content_hash]
    already_uploaded = (current_content ? current_content.uploaded : false)
    file = WFile.create(session[:user], params[:filename])
    if current_content && already_uploaded
      file.uploaded = true
      @result = { success: true, uploaded: true }
    else
      current_content = Content.create(params[:content_hash], params[:size].to_i) if current_content.nil?
      @result = { success: true, uploaded: false, needed_parts: current_content.needed_parts, part_size: PART_SIZE }
    end
    file.content = current_content
    file.update_and_save
---
INSERT INTO "Content" ("content_hash", "crypt_key", "init_vector", "size", "start_upload", "x_file_id") VALUES ('eba0445cd667ae215012706322b007851c9de2f9ffefb8a6c41838df44f62466', '3089d3b1a3d73349d0f58e40f9cb8d65f98b05eb31d3d63b9ef3ff70fa560692', '3989fc1271c934681021bf12d1ecbc5f', 331, 1361335017, 1)
UPDATE "Content" SET "x_file_id" = 3 WHERE "content_hash" = '8ba71216d77fb16b0283504556f76f04a84465bef50bec5f3f75dfd6aa5e6e96'