app/controllers/users_controller.rb

SELECT "id" FROM "User" WHERE "login" = 'guillo_k' ORDER BY "id" LIMIT 1
SELECT "id" FROM "User" WHERE "email" = 'null' ORDER BY "id" LIMIT 1
INSERT INTO "User" ("login", "email", "first_name", "last_name", "pass_hash", "pass_salt") VALUES ('guillo_k', 'kevin@gmail.com', 'Kevin', 'Guillouard', '3aaab162f6bd60afa5ab1db4b0ccf1524d55cc2897a24d348838ca87cc0dd09c', 'd6f94323277710af04697158e1f70e37cc8a1f258b601543045e9fb3c1826160')
---
  def create
    raise RequestError.new(:login_taken, "Login already taken") if User.first login: params['login']
    raise RequestError.new(:email_taken, "Email already taken") if User.first email: params['email']
    user = set_properties User.new
    user.set_password params['password']
    user.save